In [2]:
import pymysql
import pandas as pd

import warnings

In [3]:
warnings.filterwarnings('ignore')

In [8]:
try:
    connection = pymysql.connect(user='admin',
                                host='database-1.cjocas8y2rhl.us-east-1.rds.amazonaws.com',
                                port=3306,
                                password='Uukkmskp1!#',
                                database='grupo_05'
                                )
    print('Conexão feita com sucesso!')
except Exception as erro:
    print(f'Erro: {erro} - Falha na conexão')
    
cursor = connection.cursor()

Conexão feita com sucesso!

In [5]:
df = pd.read_csv('../data/clientes_genericos.csv')  
df = df[['Nome', 'Numero', 'Endereco']]

df

,Nome,Numero,Endereco
0,Marina Ribeiro,0900 145 8316,"Estrada de Albuquerque, 3, Vila Nova Gameleira..."
1,Maria Julia Caldeira,+55 81 0704-5986,"Quadra Vieira, 53, Teixeira Dias, 38987482 Rez..."
2,Maria Clara Campos,51 0650 6372,"Esplanada Silveira, 74, Ouro Minas, 70469141 G..."
3,Stephany Lopes,41 8023-9362,"Via de Oliveira, 1, Aguas Claras, 53142-358 da..."
4,Ana Lívia Souza,(051) 0318 9411,"Vereda de Gomes, Ermelinda, 06286583 Alves / DF"
...,...,...,...
145,Luiz Felipe Novais,+55 (071) 1955-2433,"Aeroporto Pires, 61, Nossa Senhora Da Conceiçã..."
146,Nicole Pires,(021) 8618 7061,"Residencial Albuquerque, Vila Pinho, 24945841 ..."
147,Maria Alice Garcia,41 7787-1865,"Viaduto da Mota, 67, Anchieta, 38310-017 Fogaç..."
148,Theodoro Barbosa,+55 (081) 7012-9506,"Pátio João Vitor da Rosa, 48, Vila Minaslandia..."
149,Cauê Carvalho,84 9382-9579,"Passarela de Pereira, 82, Leonina, 38462287 Vi..."

In [ ]:
for index, row in df.iterrows():
    query_insert = """
        INSERT INTO clientes (nome_cliente, telefone_cliente, endereco_cliente) 
        VALUES (%s, %s, %s)
    """
    values = (row['Nome'], row['Numero'], row['Endereco'])

    cursor.execute(query_insert, values)

connection.commit()

In [28]:
query = '''
    INSERT INTO produtos (nome_produto, descricao_produto) 
    VALUES
    ("Credito", "Ferramenta que permite que indivíduos e empresas obtenham dinheiro emprestado para atender a necessidades financeiras imediatas"),
    ("Investimento", "Qualquer valor capaz de gerar um lucro, seja em um período de curto, médio ou longo prazo"),
    ("Seguros", "Sao aqueles bens, especificados na apolice, para os quais a seguradora não indenizara os prejuízos, ainda que oriundos de riscos cobertos")
'''

cursor.execute(query)
connection.commit()

In [16]:
query = '''
    INSERT INTO diretoria (nome_diretor, email_diretor) 
    VALUES 
    ("João da Silva", "joao@dasilva.com.br"),
    ("Maria da Silva", "maria@dasilva.com.br"),
    ("Julio da Silva", "julio@dasilva.com.br")
'''

cursor.execute(query)
connection.commit()

In [ ]:
query = '''
    INSERT INTO tipo_cliente (tipo_cliente) 
    VALUES 
    ("Digital"),
    ("Alta Renda"),
    ("Private")
'''

cursor.execute(query)
connection.commit()

In [19]:
query = '''
    INSERT INTO tipo_produto (tipo_produto)
    VALUES
    ("Com lastro financeiro"),
    ("Sem lastro financeiro")
'''

cursor.execute(query)
connection.commit()

In [9]:
query = ''' 
    SELECT * FROM produtos
'''

pd.read_sql(query, connection)

,cod_produto,nome_produto,descricao_produto,cod_tipo_produto
0,1,Credito,Ferramenta que permite que indivíduos e empres...,None
1,2,Investimento,"Qualquer valor capaz de gerar um lucro, seja e...",None
2,3,Seguros,"Sao aqueles bens, especificados na apolice, pa...",None
3,7,Credito,Ferramenta que permite que indivíduos e empres...,None
4,8,Investimento,"Qualquer valor capaz de gerar um lucro, seja e...",None
5,9,Seguros,"Sao aqueles bens, especificados na apolice, pa...",None

In [10]:
query = ''' 
    DELETE FROM produtos
    WHERE cod_produto = 7 OR cod_produto = 8 OR cod_produto = 9
'''

cursor.execute(query)
connection.commit

In [11]:
query = ''' 
    SELECT * FROM logs
'''

pd.read_sql(query, connection)

,log_id,tabela_afetada,acao,usuario,descricao,data_acao
0,38,produtos,DELETE,admin@177.37.152.34,Produto excluído,2024-09-28 02:25:22
1,39,produtos,DELETE,admin@177.37.152.34,Produto excluído,2024-09-28 02:25:22
2,40,produtos,DELETE,admin@177.37.152.34,Produto excluído,2024-09-28 02:25:22

In [12]:
connection.close()